In [83]:
import pandas as pd
import numpy as np

In [84]:
# load file
file_load = "Resources/Salary_Data.csv"

In [85]:
# read file and store in Pandas DataFrame
salary_data_df = pd.read_csv(file_load)
salary_data_df.head()

,timestamp,company,level,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,tag,basesalary,...,Doctorate_Degree,Highschool,Some_College,Race_Asian,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic,Race,Education
0,6/7/17 11:33,Oracle,L3,Product Manager,127000,"Redwood City, CA",1.5,1.5,NaN,107000,...,0,0,0,0,0,0,0,0,NaN,NaN
1,6/10/17 17:11,eBay,SE 2,Software Engineer,100000,"San Francisco, CA",5.0,3.0,NaN,0,...,0,0,0,0,0,0,0,0,NaN,NaN
2,6/11/17 14:53,Amazon,L7,Product Manager,310000,"Seattle, WA",8.0,0.0,NaN,155000,...,0,0,0,0,0,0,0,0,NaN,NaN
3,6/17/17 0:23,Apple,M1,Software Engineering Manager,372000,"Sunnyvale, CA",7.0,5.0,NaN,157000,...,0,0,0,0,0,0,0,0,NaN,NaN
4,6/20/17 10:58,Microsoft,60,Software Engineer,157000,"Mountain View, CA",5.0,3.0,NaN,0,...,0,0,0,0,0,0,0,0,NaN,NaN

In [86]:
# see columns
salary_data_df.columns

Index(['timestamp', 'company', 'level', 'title', 'totalyearlycompensation',
       'location', 'yearsofexperience', 'yearsatcompany', 'tag', 'basesalary',
       'stockgrantvalue', 'bonus', 'gender', 'otherdetails', 'cityid', 'dmaid',
       'rowNumber', 'Masters_Degree', 'Bachelors_Degree', 'Doctorate_Degree',
       'Highschool', 'Some_College', 'Race_Asian', 'Race_White',
       'Race_Two_Or_More', 'Race_Black', 'Race_Hispanic', 'Race', 'Education'],
      dtype='object')

In [87]:
# check data types
salary_data_df.dtypes

timestamp                   object
company                     object
level                       object
title                       object
totalyearlycompensation      int64
location                    object
yearsofexperience          float64
yearsatcompany             float64
tag                         object
basesalary                   int64
stockgrantvalue            float64
bonus                      float64
gender                      object
otherdetails                object
cityid                       int64
dmaid                      float64
rowNumber                    int64
Masters_Degree               int64
Bachelors_Degree             int64
Doctorate_Degree             int64
Highschool                   int64
Some_College                 int64
Race_Asian                   int64
Race_White                   int64
Race_Two_Or_More             int64
Race_Black                   int64
Race_Hispanic                int64
Race                        object
Education                   object
dtype: object

In [88]:
# get columns and rows that ar not null
salary_data_df.count()

timestamp                  62642
company                    62637
level                      62523
title                      62642
totalyearlycompensation    62642
location                   62642
yearsofexperience          62642
yearsatcompany             62642
tag                        61788
basesalary                 62642
stockgrantvalue            62642
bonus                      62642
gender                     43102
otherdetails               40137
cityid                     62642
dmaid                      62640
rowNumber                  62642
Masters_Degree             62642
Bachelors_Degree           62642
Doctorate_Degree           62642
Highschool                 62642
Some_College               62642
Race_Asian                 62642
Race_White                 62642
Race_Two_Or_More           62642
Race_Black                 62642
Race_Hispanic              62642
Race                       22427
Education                  30370
dtype: int64

In [89]:
# get sum on columns and rows that are not null
salary_data_df.isnull().sum()

timestamp                      0
company                        5
level                        119
title                          0
totalyearlycompensation        0
location                       0
yearsofexperience              0
yearsatcompany                 0
tag                          854
basesalary                     0
stockgrantvalue                0
bonus                          0
gender                     19540
otherdetails               22505
cityid                         0
dmaid                          2
rowNumber                      0
Masters_Degree                 0
Bachelors_Degree               0
Doctorate_Degree               0
Highschool                     0
Some_College                   0
Race_Asian                     0
Race_White                     0
Race_Two_Or_More               0
Race_Black                     0
Race_Hispanic                  0
Race                       40215
Education                  32272
dtype: int64

Want to get rid of columns that have a high number of nulls : 'level', 'tag', 'gender', 'otherdetails', 'Race' and 'Education'
We can also delete the rows that have null values in 'company' and 'dmaid'

In [90]:
# drop columns 'level', 'tag', 'gender', 'otherdetails', 'Race' and 'Education' 
clean_salary_data_df = salary_data_df.drop(['tag', 'gender', 'otherdetails', 'Race', 'Education','cityid', 'dmaid'], axis=1)

In [91]:
# see columns
clean_salary_data_df.columns

Index(['timestamp', 'company', 'level', 'title', 'totalyearlycompensation',
       'location', 'yearsofexperience', 'yearsatcompany', 'basesalary',
       'stockgrantvalue', 'bonus', 'cityid', 'dmaid', 'rowNumber',
       'Masters_Degree', 'Bachelors_Degree', 'Doctorate_Degree', 'Highschool',
       'Some_College', 'Race_Asian', 'Race_White', 'Race_Two_Or_More',
       'Race_Black', 'Race_Hispanic'],
      dtype='object')

In [92]:
#drop rows that have na values
clean_salary_data_df = clean_salary_data_df.dropna()

In [93]:
# get sum on columns and rows that are not null
clean_salary_data_df.isnull().sum()

timestamp                  0
company                    0
level                      0
title                      0
totalyearlycompensation    0
location                   0
yearsofexperience          0
yearsatcompany             0
basesalary                 0
stockgrantvalue            0
bonus                      0
cityid                     0
dmaid                      0
rowNumber                  0
Masters_Degree             0
Bachelors_Degree           0
Doctorate_Degree           0
Highschool                 0
Some_College               0
Race_Asian                 0
Race_White                 0
Race_Two_Or_More           0
Race_Black                 0
Race_Hispanic              0
dtype: int64

In [94]:
clean_salary_data_df.count()

timestamp                  62516
company                    62516
level                      62516
title                      62516
totalyearlycompensation    62516
location                   62516
yearsofexperience          62516
yearsatcompany             62516
basesalary                 62516
stockgrantvalue            62516
bonus                      62516
cityid                     62516
dmaid                      62516
rowNumber                  62516
Masters_Degree             62516
Bachelors_Degree           62516
Doctorate_Degree           62516
Highschool                 62516
Some_College               62516
Race_Asian                 62516
Race_White                 62516
Race_Two_Or_More           62516
Race_Black                 62516
Race_Hispanic              62516
dtype: int64

In [48]:
# drop columns 'Masters_Degree','Bachelors_Degree', 'Doctorate_Degree', 'Highschool', 'Some_College',
      ## 'Race_Asian', 'Race_White', 'Race_Two_Or_More', 'Race_Black','Race_Hispanic'
    ## they are mostly all 0 and will not be of any use
clean_salary_data_df = clean_salary_data_df.drop(['Masters_Degree',
       'Bachelors_Degree', 'Doctorate_Degree', 'Highschool', 'Some_College',
       'Race_Asian', 'Race_White', 'Race_Two_Or_More', 'Race_Black',
       'Race_Hispanic','rowNumber' ], axis=1)

In [49]:
clean

,timestamp,company,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,cityid,dmaid
0,6/7/17 11:33,Oracle,Product Manager,127000,"Redwood City, CA",1.5,1.5,107000,20000.0,10000.0,7392,807.0
1,6/10/17 17:11,eBay,Software Engineer,100000,"San Francisco, CA",5.0,3.0,0,0.0,0.0,7419,807.0
2,6/11/17 14:53,Amazon,Product Manager,310000,"Seattle, WA",8.0,0.0,155000,0.0,0.0,11527,819.0
3,6/17/17 0:23,Apple,Software Engineering Manager,372000,"Sunnyvale, CA",7.0,5.0,157000,180000.0,35000.0,7472,807.0
4,6/20/17 10:58,Microsoft,Software Engineer,157000,"Mountain View, CA",5.0,3.0,0,0.0,0.0,7322,807.0
...,...,...,...,...,...,...,...,...,...,...,...,...
62637,9/9/18 11:52,Google,Software Engineer,327000,"Seattle, WA",10.0,1.0,155000,150000.0,22000.0,11527,819.0
62638,9/13/18 8:23,Microsoft,Software Engineer,237000,"Redmond, WA",2.0,2.0,146900,73200.0,16000.0,11521,819.0
62639,9/13/18 14:35,MSFT,Software Engineer,220000,"Seattle, WA",14.0,12.0,157000,25000.0,20000.0,11527,819.0
62640,9/16/18 16:10,Salesforce,Software Engineer,280000,"San Francisco, CA",8.0,4.0,194688,57000.0,29000.0,7419,807.0
62641,1/29/19 5:12,apple,Software Engineer,200000,"Sunnyvale, CA",0.0,0.0,155000,27000.0,19000.0,7472,807.0

In [77]:
clean_salary_data_df['timestamp'] = pd.to_datetime(clean_salary_data_df['timestamp'])

In [78]:
clean_salary_data_df.dtypes

timestamp                  datetime64[ns]
company                            object
title                              object
totalyearlycompensation             int64
location                           object
yearsofexperience                 float64
yearsatcompany                    float64
basesalary                          int64
stockgrantvalue                   float64
bonus                             float64
cityid                              int64
dmaid                             float64
dtype: object

In [79]:
clean_salary_data_sample = clean_salary_data_df.sample(100)
clean_salary_data_sample

,timestamp,company,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,cityid,dmaid
58537,2021-07-21 22:58:00,Oracle,Software Engineer,390000,"Seattle, WA",6.0,1.0,180000,210000.0,0.0,11527,819.0
25855,2020-08-06 08:05:00,Apple,Technical Program Manager,211000,"Cupertino, CA",5.0,0.0,160000,26000.0,25000.0,7158,807.0
16729,2020-02-15 00:06:00,Samsung,Product Designer,47000,"Bangalore, KA, India",5.0,4.5,30000,0.0,17000.0,4058,0.0
28571,2020-09-02 15:18:00,IBM,Software Engineer,72000,"Paris, IL, France",9.0,8.0,72000,0.0,1000.0,6409,0.0
44903,2021-03-13 15:06:00,Facebook,Software Engineering Manager,1325000,"Menlo Park, CA",20.0,2.0,325000,900000.0,100000.0,7300,807.0
...,...,...,...,...,...,...,...,...,...,...,...,...
60464,2021-08-06 06:46:00,Bloomberg,Software Engineer,183000,"New York, NY",2.0,2.0,158000,0.0,25000.0,10182,501.0
43222,2021-02-26 06:22:00,Booking.com,Software Engineer,144000,"Amsterdam, NH, Netherlands",8.0,0.0,108000,20000.0,16000.0,6580,0.0
16385,2020-02-10 06:46:00,Wayfair,Software Engineer,138000,"Boston, MA",1.0,1.0,112000,15000.0,11000.0,8816,506.0
28772,2020-09-03 15:22:00,amazon,Technical Program Manager,185000,"Seattle, WA",10.0,2.0,153000,22000.0,10000.0,11527,819.0
12948,2019-11-11 12:00:00,Amazon,Product Manager,175000,"Seattle, WA",4.0,4.0,106000,69000.0,0.0,11527,819.0

In [70]:
print(company_df)

company
10x Genomics     6
23andMe          7
2U               7
3M              21
3m               3
                ..
zoom             1
zoominfo         1
zoox             3
zynga            1
 Google          1
Length: 1631, dtype: int64